DataProcessors/АРМУчетСерийныхНомеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>АРМУчетСерийныхНомеров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаказаДР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабЭтапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчетСерийныхНомеров</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндексКартинки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗапуска</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтапПроизводства</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерийныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Запланировано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШильдЗаказан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШильдВНаличии</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ТТМ_УчетСерийныхНомеровПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТТМ_УчетСерийныхНомеровПродукции</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШильдЗаказан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Произведено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реализовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СтатусыЭтаповПроизводства2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыЭтаповПроизводства2_2</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Начат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыЗаказовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыЗаказовКлиентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОбеспечению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИспользованиеХарактеристик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИспользованияХарактеристикНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/АРМУчетСерийныхНомеров/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	НачальныйНомер = 0;
	ЭтапыЗагружены = ОбновитьТаблицуЭтапов();
	Если не ЭтапыЗагружены Тогда 
		Сообщить("Ошибка обновления таблицы этапов!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
//БезКонтекста
Функция ОбновитьТаблицуЭтапов()
	
	СтруктураОтбора = Новый Структура;
	
	Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда 
		СтруктураОтбора.Вставить("Номенклатура",Объект.Номенклатура);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ЗаказКлиента) Тогда  
		СтруктураОтбора.Вставить("ЗаказКлиента",Объект.ЗаказКлиента);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НоменклатураДополнительныеРеквизиты.Ссылка КАК Ссылка,
	               |	НоменклатураДополнительныеРеквизиты.Свойство КАК Свойство,
	               |	НоменклатураДополнительныеРеквизиты.Значение КАК Значение
	               |ПОМЕСТИТЬ ВТ_УчетСН
	               |ИЗ
	               |	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	               |ГДЕ
	               |	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство
	               |	И НоменклатураДополнительныеРеквизиты.Значение = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЛОЖЬ КАК Отметка,
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка КАК ЭтапПроизводства,
	               |	ЕСТЬNULL(ВТ_УчетСН.Значение, ЛОЖЬ) КАК УчетСерийныхНомеров,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ВТ_УчетСН.Значение, ЛОЖЬ) = ЛОЖЬ
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ИндексКартинки,
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура КАК Номенклатура,
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Назначение КАК Назначение,
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.ФактическоеНачалоЭтапа КАК ДатаЗапуска,
	               |	ЕСТЬNULL(ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер, """") КАК СерийныйНомер,
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.КоличествоУпаковокПлан КАК Запланировано,
	               |	ЕСТЬNULL(ТТМ_УчетСерийныхНомеровПродукции.ШильдЗаказан, ЛОЖЬ) КАК ШильдЗаказан
	               |ИЗ
	               |	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции КАК ТТМ_УчетСерийныхНомеровПродукции
	               |		ПО (ТТМ_УчетСерийныхНомеровПродукции.Регистратор = ЭтапПроизводства2_2ВыходныеИзделия.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УчетСН КАК ВТ_УчетСН
	               |		ПО ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура = ВТ_УчетСН.Ссылка
	               |ГДЕ
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Проведен
	               |	И НЕ ЭтапПроизводства2_2ВыходныеИзделия.Отменено
	               |	И ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Начат))
	               |	И НЕ ЭтапПроизводства2_2ВыходныеИзделия.Произведено
				   //|";
				   |	&УсловиеНоменклатура
				   |	&УсловиеЗаказКлиента  
				   |
	               |СГРУППИРОВАТЬ ПО
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка,
	               |	ЕСТЬNULL(ВТ_УчетСН.Значение, ЛОЖЬ),
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ВТ_УчетСН.Значение, ЛОЖЬ) = ЛОЖЬ
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ,
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура,
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Назначение,
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.ФактическоеНачалоЭтапа,
	               |	ЕСТЬNULL(ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер, """"),
	               |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.КоличествоУпаковокПлан,
	               |	ЕСТЬNULL(ТТМ_УчетСерийныхНомеровПродукции.ШильдЗаказан, ЛОЖЬ)
				   |УПОРЯДОЧИТЬ ПО                     
				   |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.ФактическоеНачалоЭтапа,
				   |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Дата,
				   |	ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Номер,
	               |	ЕСТЬNULL(ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер, """")";
				 //|	ЭтапПроизводства2_2ВыходныеИзделия.Назначение";
				   
//|	И ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура В(&Номенклатура)
//|	И ЭтапПроизводства2_2ВыходныеИзделия.Назначение.Заказ В(&Заказ)" 
	
	Если СтруктураОтбора.Свойство("Номенклатура") и ЗначениеЗаполнено(СтруктураОтбора.Номенклатура) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеНоменклатура"," И ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура = &Номенклатура ");		
		Запрос.УстановитьПараметр("Номенклатура",Объект.Номенклатура);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеНоменклатура","");
	КонецЕсли;
	
	Если СтруктураОтбора.Свойство("ЗаказКлиента") и ЗначениеЗаполнено(СтруктураОтбора.ЗаказКлиента) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеЗаказКлиента"," И ЭтапПроизводства2_2ВыходныеИзделия.Назначение.Заказ = &Заказ ");
		Запрос.УстановитьПараметр("Заказ", Объект.ЗаказКлиента);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеЗаказКлиента","");
	КонецЕсли;  
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","УчитываатьСерийныеНомераНоменклатуры_ТТМ"));
	
	Попытка
		ТЗЭтапы = Запрос.Выполнить().Выгрузить();
		Объект.ТабЭтапы.Загрузить(ТЗЭтапы); 
		Возврат Истина;
	Исключение   
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////////////////////////////////
#Область ДополнительныеКоманды 

&НаКлиенте
Процедура ОтметитьВсеЭтапы(Команда)  
		
	Для Каждого Стр из Объект.ТабЭтапы Цикл 
		стр.Отметка = Истина;
	КонецЦикла;		
	
КонецПроцедуры 

&НаКлиенте
Процедура СнятьОтметкиВсе(Команда)   

	Для Каждого Стр из Объект.ТабЭтапы Цикл 
		стр.Отметка = Ложь;
	КонецЦикла;   
	
КонецПроцедуры

#КонецОбласти

/////////////////////////////////////////////////////////////
&НаКлиенте
Процедура ЗаказКлиентаПриИзменении(Элемент)
		
	ЭтапыЗагружены = ОбновитьТаблицуЭтапов();
	Если не ЭтапыЗагружены Тогда 
		Сообщить("Ошибка обновления таблицы этапов!");
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьЗаказНаСервере()
	Документы.ЗаказКлиента.ПустаяСсылка();	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказКлиентаОчистка(Элемент, СтандартнаяОбработка)
	ОчиститьЗаказНаСервере();
КонецПроцедуры

/////////////////////////////////////////////////////////          

#Область ПодборЗаказаКлиента

&НаКлиенте
Процедура ЗаказКлиентаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)	
	СтандартнаяОбработка = Ложь;	
	ДанныеВыбора = ПолучитьДанныеВыбораРасширенные(Текст);	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеВыбораРасширенные(СтрокаПоиска)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("СтрокаПоиска", СтрокаПоиска);
	СтруктураОтбора.Вставить("ВводПоСтрокеРасширенный", Истина);
	
	СтрокаПоиска = СтрЗаменить(СтруктураОтбора.СтрокаПоиска, """", ""); 
	
	Если СтрокаПоиска <> "" И СтруктураОтбора.Свойство("ВводПоСтрокеРасширенный") Тогда
		МассивСловПоиска = СтрРазделить(СтрокаПоиска, " ", Ложь); 

		Запрос = Новый Запрос;
        Запрос.Текст = "ВЫБРАТЬ		
						|	Назначения.Заказ КАК Заказ,
						|	Назначения.Наименование КАК Наименование,
						|	Назначения.ПометкаУдаления КАК ПометкаУдаления
						|ПОМЕСТИТЬ ВТ_ЗаказКлиентаОтборПоНомеру
						|ИЗ
						|	Справочник.Назначения КАК Назначения
						|ГДЕ
						|	Назначения.Наименование ПОДОБНО &СловоПоиска
						|	И НЕ Назначения.ПометкаУдаления
						|	И НЕ Назначения.Заказ.ПометкаУдаления
						|	И Назначения.Заказ.Статус <> &СтатусЗаказа
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	СостоянияЗаказовКлиентов.Заказ КАК Заказ,
						|	ВТ_ЗаказКлиентаОтборПоНомеру.Наименование КАК Наименование,
						|	ВТ_ЗаказКлиентаОтборПоНомеру.ПометкаУдаления КАК ПометкаУдаления
						|ИЗ
						|	ВТ_ЗаказКлиентаОтборПоНомеру КАК ВТ_ЗаказКлиентаОтборПоНомеру
						|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
						|		ПО (СостоянияЗаказовКлиентов.Заказ = ВТ_ЗаказКлиентаОтборПоНомеру.Заказ)
						|ГДЕ
						|	СостоянияЗаказовКлиентов.Состояние <> &Состояние";
		
		Запрос.УстановитьПараметр("СловоПоиска", "%" + СтрокаПоиска + "%");
		Запрос.УстановитьПараметр("СтатусЗаказа", Перечисления.СтатусыЗаказовКлиентов.Закрыт);
		Запрос.УстановитьПараметр("Состояние", Перечисления.СостоянияЗаказовКлиентов.ГотовКЗакрытию);
				
		Выборка = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = Выборка.Выбрать();
		
		СписокВыбора = Новый СписокЗначений;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Значение", ВыборкаДетальныеЗаписи.Заказ);
			СтруктураОтбора.Вставить("ПометкаУдаления", ВыборкаДетальныеЗаписи.ПометкаУдаления);
			
			СписокВыбора.Добавить(СтруктураОтбора, ТТМ_ДанныеВыбораСервер.ПодсветитьСлова(ВыборкаДетальныеЗаписи.Наименование, МассивСловПоиска));
		КонецЦикла;

		ДанныеВыбора = СписокВыбора;
	КонецЕсли;
		
	Возврат ДанныеВыбора;	
	
КонецФункции

&НаКлиенте
Процедура ЗаказКлиентаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Если Текст = "" Тогда
		ОчиститьЗаказНаСервере();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

/////////////////////////////////////////////////////////


//01.07.2025
//на данный моммент решили регистрировать серийные номера при заказе Шильдов на продукцию
&НаКлиенте
Процедура ЗаказатьШильды(Команда) 
	
	ДанныеОбработки = ОпределитьДанныедляОбработки();  
	Номенклатура = ДанныеОбработки.Номенклатура;
	МассивЭтапов = ДанныеОбработки.МассивЭтапов;
	//ПараметрыОтбора = Новый Структура("Отметка", Истина);
	//МассивСтрок = Объект.ТабЭтапы.НайтиСтроки(ПараметрыОтбора);
	//
	//МассивЭтапов = Новый Массив;   
	//Если МассивСтрок.Количество() > 0 Тогда 
	//	Для Каждого Стр из МассивСтрок Цикл              
	//		МассивЭтапов.Добавить(Стр.ЭтапПроизводства);
	//	КонецЦикла;    
	//Иначе 
	//	МассивЭтапов.Добавить(Элементы.ТабЭтапы.ТекущиеДанные.ЭтапПроизводства);
	//КонецЕсли;
	//
	//Номенклатура = Элементы.ТабЭтапы.ТекущиеДанные.Номенклатура;    
	
	СерийныеНомераЗарегистрированы = ЗарегистрироватьСерийныеномераЗаказатьШильды(Номенклатура, МассивЭтапов, НачальныйНомер);
	Если не СерийныеНомераЗарегистрированы Тогда 
		Сообщить("Не удалось зарегистрировать серийные номера на продукцию "+ Номенклатура + "!");
	Иначе 
		Сообщить("Серийные номера успешно зарегистрированы!");
	КонецЕсли;     
	
	
	//ТекСтрока = Элементы.ТабЭтапы.ТекущиеДанные.НомерСтроки; //.ПолучитьИдентификатор();
	
	ЭтапыЗагружены = ОбновитьТаблицуЭтапов();
	
	ПараметрыОтбора = Новый Структура("Номенклатура, ЭтапПроизводства",Номенклатура,МассивЭтапов[0]); 
	Если Объект.ТабЭтапы.НайтиСтроки(ПараметрыОтбора).Количество() > 0 Тогда 
		ТекСтрока = Объект.ТабЭтапы.НайтиСтроки(ПараметрыОтбора)[0]; 
		Элементы.ТабЭтапы.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры    

&НаСервереБезКонтекста 
Функция ЗарегистрироватьСерийныеномераЗаказатьШильды(Номенклатура, МассивЭтапов, НачальныйНомер)
	
	//1. Проверим/установим признак учета серийных номеров для продукции   
	
	ВключитьУчетПоСерийнымНомерам = Ложь;
	ВключенУчетСерийныхНомеров = ТТМ_СерийныйУчет.ПроверитьУстановитьУчетСерийныхНомеров(Номенклатура, ВключитьУчетПоСерийнымНомерам);	
		
	//2.    
	
	Если ВключенУчетСерийныхНомеров Тогда    
		//ДанныеЭтапа = ТТМ_СерийныйУчет.ПолучитьДанныеЭтапа(МассивЭтапов[0].ЭтапПроизводства);
		КоличествоЗаписанныхСерийныхномеров = 0;
		Для Каждого ЭтапПроизводства Из МассивЭтапов Цикл   
			НачальныйНомер = ?(ЗначениеЗаполнено(НачальныйНомер), НачальныйНомер + КоличествоЗаписанныхСерийныхномеров, 0);
			СерийныйНомерУстановлен = ТТМ_СерийныйУчет.ЗаписатьСерийныйНомерПродукцииПослеПроверки(ЭтапПроизводства,НачальныйНомер); //ПроверитьЗаписатьСерийныйНомерПродукцииПриВыпуске(ЭтапПроизводства);
			//ТТМ_СерийныйУчет.СгененироватьСерийныйНомер(Стр.Номенклатура, Стр.ДатаЗапуска, НачальныйНомер, 
			Если не СерийныйНомерУстановлен Тогда 
				Сообщить("Не удалось установить серийные номера для продукции " + Номенклатура + " по этапу " + ЭтапПроизводства, СтатусСообщения.Важное);
				Возврат Ложь; 
			КонецЕсли;
			КоличествоЗаписанныхСерийныхномеров = ЭтапПроизводства.КоличествоУпаковокПлан;
		КонецЦикла;
		Возврат Истина;
	Иначе  
		Сообщить("Не включен учет серийных номеров для продукции " + Номенклатура);
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

//Функция ЗарегистрироватьСерийныеНомераЗаказатьШильды(МассивЭтапов)
//	    
//	Для Каждого ЭтапПроизводства Из МассивЭтапов Цикл  
//		СерийныйНомерУстановлен = ТТМ_СерийныйУчет.ПроверитьЗаписатьСерийныйНомерПродукцииПриВыпуске(ЭтапПроизводства, НачальныйНомер);
//		//ТТМ_СерийныйУчет.СгененироватьСерийныйНомер(Стр.Номенклатура, Стр.ДатаЗапуска, НачальныйНомер, 
//		Если не СерийныйНомерУстановлен Тогда 
//			Сообщить("Не удалось установить серийные номера для продукции " + Номенклатура + " по этапу " + ЭтапПроизводства, СтатусСообщения.Важное);
//		КонецЕсли;
//	КонецЦикла;
//	
//КонецФункции

&НаКлиенте
Процедура ОтменитьЗаказ(Команда) 
	
	ДанныеОбработки = ОпределитьДанныедляОбработки();
	Если ДанныеОбработки = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	//ДопПараметры = Новый Структура("МассивНоменклатуры, МассивЭтапов");
	//ЗаполнитьЗначенияСвойств(ДопПараметры,, ДанныеОбработки.МассивНоменклатуры, ДанныеОбработки.МассивЭтапов);
	ОповещениеОтменитьЗаказШильда = Новый ОписаниеОповещения("ОтменитьЗаказШильдаПродолжение", Этаформа, ДанныеОбработки);
	ПоказатьВопрос(ОповещениеОтменитьЗаказШильда, "Удалить серийный номер для " + ДанныеОбработки.Номенклатура + "?",РежимДиалогаВопрос.ДаНет);
		
КонецПроцедуры        

&НаКлиенте
Процедура ОтменитьЗаказШильдаПродолжение(Результат, ДопПараметры) Экспорт 
	
	//1. Проверим, что в регистре есть остаток по текущему серийномуНомеру
	
	Если Результат = КодВозвратаДиалога.Нет Тогда 
		//Отменяем только заказ шильда!!!          
		УдалятьСтроку = Ложь;
		ОтменаВыполнена = ОтменитьЗаказШильдаНаСервере(Доппараметры, УдалятьСтроку);
	Иначе 
		//Удалить строку из регистра
		УдалятьСтроку = Истина;
		ОтменаВыполнена = ОтменитьЗаказШильдаНаСервере(ДопПараметры, УдалятьСтроку);
	КонецЕсли;   
	
	Если ОтменаВыполнена Тогда 
		
		ЭтапыЗагружены = ОбновитьТаблицуЭтапов();  
		
		ПараметрыОтбора = Новый Структура("Номенклатура, ЭтапПроизводства", ДопПараметры.Номенклатура,ДопПараметры.МассивЭтапов[0]); 
		Если Объект.ТабЭтапы.НайтиСтроки(ПараметрыОтбора).Количество() > 0 Тогда 
			ТекСтрока = Объект.ТабЭтапы.НайтиСтроки(ПараметрыОтбора)[0]; 
			Элементы.ТабЭтапы.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
		КонецЕсли; 
		
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Функция ОпределитьДанныедляОбработки()
	
	СтруктураВозврата = Новый Структура("Номенклатура, МассивНоменклатуры, ДанныеТекущейСтроки, МассивЭтапов, МассивСерийныхномеров, КоличествоИзделий, МассивСтрок");
	
	ДанныеТекСтроки = ПолучитьСтруктуруТекущейСтроки();
	ЗаполнитьЗначенияСвойств(ДанныеТекСтроки, Элементы.ТабЭтапы.ТекущиеДанные);   
	
	СтруктураВозврата.ДанныеТекущейСтроки = ДанныеТекСтроки;
	
	//************************************************//   
	ДанныеТабЭтапы = ПолучитьДанныеВыделенныхСтрок();
	ЗаполнитьЗначенияСвойств(СтруктураВозврата, ДанныеТабЭтапы);
	//************************************************//   
	
	//МассивЭтапов = Новый Массив;
	//МассивНоменклатуры = Новый Массив;
	//МассивСерийныхНомеров = Новый Массив;  
	МассивСтрок = Новый Массив;
	//
	Для Каждого СтрЭтапы из ОБъект.ТабЭтапы Цикл    //Объект.ТабЭтапы 
		
		Если СтрЭтапы.Отметка Тогда 
	//		Если МассивЭтапов.Найти(СтрЭтапы.ЭтапПроизводства) = Неопределено Тогда 
	//			МассивЭтапов.Добавить(СтрЭтапы.ЭтапПроизводства);
	//		КонецЕсли; 
	//		Если МассивНоменклатуры.Найти(СтрЭтапы.Номенклатура) = Неопределено Тогда 
	//			МассивНоменклатуры.Добавить(СтрЭтапы.Номенклатура);
	//		КонецЕсли;
	//		Если МассивСерийныхНомеров.Найти(СтрЭтапы.СерийныйНомер) = Неопределено Тогда 
	//			МассивСерийныхНомеров.Добавить(СтрЭтапы.СерийныйНомер);
	//		КонецЕсли;
	//		
			ДанныеСтроки = ПолучитьСтруктуруТекущейСтроки();
			ЗаполнитьЗначенияСвойств(ДанныеСтроки,СтрЭтапы);
			МассивСтрок.Добавить(ДанныеСтроки);
		КонецЕсли;   
		
	КонецЦикла;
	СтруктураВозврата.МассивСтрок = МассивСтрок;
	//
	//КоличествоИзделий = 0;
	//Т = ОБъект.ТабЭтапы.Выгрузить().Свернуть("ЭтапПроизводства,Запланировано",);
	//КоличествоИзделий = Т.Итог("Запланирвоано");
	
	//Для Каждого этап из МассивЭтапов Цикл    
	//	
	//	КоличествоИзделий = КоличествоИзделий + Этап.Запланировано;   	
	//КонецЦикла;
	
	Если СтруктураВозврата.МассивЭтапов.Количество() = 0 Тогда 
		СтруктураВозврата.МассивЭтапов.Добавить(Элементы.ТабЭтапы.ТекущиеДанные.ЭтапПроизводства);
	КонецЕсли;  
	Если СтруктураВозврата.МассивЭтапов.Количество() = 0 Тогда 
		Сообщить("Не удалось определить этапы для обработки!");
		Возврат Неопределено;
	КонецЕсли;    
	
	Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда  
		Номенклатура = Объект.Номенклатура;
	Иначе              
		//ДанныеТекСтроки = Элементы.ТабЭтапы.ТекущиеДанные;
		Номенклатура = Элементы.ТабЭтапы.ТекущиеДанные.Номенклатура;
	КонецЕсли;                                    
	
	СтруктураВозврата.Номенклатура = Номенклатура; 
	
	Если СтруктураВозврата.Свойство("МассивНоменклатуры") и СтруктураВозврата.МассивНоменклатуры.Количество() = 0 Тогда 
		СтруктураВозврата.МассивНоменклатуры.Добавить(Номенклатура);
		Если СтруктураВозврата.МассивНоменклатуры.Количество() = 0 Тогда 
			Сообщить("Не удалось определить Номенклатуру для обработки!");
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;  
	
	
	Если СтруктураВозврата.Свойство("МассивСерийныхНомеров") и СтруктураВозврата.МассивСерийныхНомеров.Количество() = 0 Тогда 
		СтруктураВозврата.МассивСерийныхНомеров.Добавить(ДанныеТекСтроки.СерийныйНомер);
	КонецЕсли;  
	
	Если СтруктураВозврата.Свойство("КоличествоИзделий") и СтруктураВозврата.КоличествоИзделий = 0 Тогда 
		СтруктураВозврата.КоличествоИзделий = ДанныеТекСтроки.Запланировано;
	КонецЕсли;  
	
	Если СтруктураВозврата.Свойство("МассивСтрок") и СтруктураВозврата.МассивСтрок.Количество() = 0 Тогда 
		СтруктураВозврата.МассивСтрок.Добавить(СтруктураВозврата.ДанныеТекущейСтроки);
	КонецЕсли;
	
	//СтруктураВозврата.Номенклатура = Номенклатура;      
	//СтруктураВозврата.МассивНоменклатуры = МассивНоменклатуры;
	//СтруктураВозврата.МассивЭтапов = МассивЭтапов; 
	//СтруктураВозврата.МассивСерийныхномеров = МассивСерийныхНомеров;
	//СтруктураВозврата.КоличествоИзделий = КоличествоИзделий;
	
	
	Возврат СтруктураВозврата;
	
КонецФункции    

&НаСервере
Функция ПолучитьДанныеВыделенныхСтрок()
	
	ПараметрыПоиска = Новый Структура("отметка",Истина);
	ТЧ = Объект.ТабЭтапы.Выгрузить(ПараметрыПоиска,); 
	//МассивСтрок = Объект.ТабЭтапы.НайтиСтроки(ПараметрыПоиска);
	
	ТЭтапы = ТЧ.Скопировать();           
	
	ТЭтапы.Свернуть("ЭтапПроизводства, Запланировано");    
	КоличествоИзделий = ТЭтапы.Итог("Запланировано");
	МассивЭтапов = ТЭтапы.ВыгрузитьКолонку("ЭтапПроизводства");
	
	ТНоменклатура = ТЧ.Скопировать();
	ТНоменклатура.Свернуть("Номенклатура");
	МассивНоменклатуры = ТНоменклатура.ВыгрузитьКолонку("Номенклатура");
	
	ТСерийныеНомера = ТЧ.Скопировать();
	ТСерийныеНомера.Свернуть("СерийныйНомер");
	МассивСерийныхНомеров = ТСерийныеНомера.ВыгрузитьКолонку("СерийныйНомер"); 
	
	СтруктураВозврата = Новый Структура;
	//СтруктураВозврата.Вставить("МассивСтрок", МассивСтрок);
	СтруктураВозврата.Вставить("КоличествоИзделий", КоличествоИзделий);
	СтруктураВозврата.Вставить("МассивЭтапов", МассивЭтапов);               
	СтруктураВозврата.Вставить("МассивНоменклатуры", МассивНоменклатуры);
	СтруктураВозврата.Вставить("МассивСерийныхНомеров", МассивСерийныхНомеров);
	
	Возврат СтруктураВозврата;
		
КонецФункции

&НаКлиенте
Функция ПолучитьСтруктуруТекущейСтроки()
	Возврат Новый Структура("Номенклатура, ДатаЗапуска, ЭтапПроизводства, Назначение, Серийныйномер, Запланировано, ШильдЗаказан, КоличествоИзделий");
КонецФункции   

&НаСервере
Функция ОтменитьЗаказШильдаНаСервере(ДопПараметры, УдалитьСтроку = Ложь)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстаткиИОбороты.Склад КАК Склад,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстаткиИОбороты.Номенклатура КАК Номенклатура,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстаткиИОбороты.Назначение КАК Назначение,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстаткиИОбороты.СерийныйНомер КАК СерийныйНомер,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстаткиИОбороты.ШильдЗаказан КАК ШильдЗаказан,
	               |	СУММА(ТТМ_УчетСерийныхНомеровПродукцииОстаткиИОбороты.КоличествоКонечныйОстаток) КАК КоличествоОстаток,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстаткиИОбороты.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции.ОстаткиИОбороты(
	               |			,
	               |			,
	               |			Авто,
	               |			,
	               |			СерийныйНомер В (&МассивСерийныхНомеров)
	               |				И Номенклатура В (&МассивНоменклатуры)
	               |				И НЕ Произведено) КАК ТТМ_УчетСерийныхНомеровПродукцииОстаткиИОбороты
	               |ГДЕ
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстаткиИОбороты.КоличествоКонечныйОстаток > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстаткиИОбороты.Склад,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстаткиИОбороты.Номенклатура,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстаткиИОбороты.Назначение,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстаткиИОбороты.СерийныйНомер,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстаткиИОбороты.ШильдЗаказан,
	               |	ТТМ_УчетСерийныхНомеровПродукцииОстаткиИОбороты.Регистратор";
	
	Запрос.УстановитьПараметр("МассивСерийныхНомеров", ДопПараметры.МассивСерийныхНомеров);
	Запрос.УстановитьПараметр("МассивНоменклатуры", ДопПараметры.МассивНоменклатуры);
	Выборка = Запрос.Выполнить().Выбрать();   
	//ТЗ = Запрос.Выполнить().Выгрузить();  
	МожноОтменить = Запрос.Выполнить().Выгрузить().Итог("КоличествоОстаток");
	
	//МожноОтменить = Выборка.КоличествоОстаток; 
	НужноОтменить = ДопПараметры.КоличествоИзделий;
	Если НужноОтменить > МожноОтменить Тогда
		ТекстСообщения = "Недостаточно остатка неотгруженных изделий  для отмены";
		Если УдалитьСтроку Тогда 
			ТекстСообщения = ТекстСообщения + " серийных номеров!";
		Иначе 
			ТекстСообщения = ТекстСообщения + " заказаных шильдов!";
		КонецЕсли;
		Сообщить(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл  
		//Есть остаток - можно заменить шильд   
				
		НЗ = РегистрыНакопления.ТТМ_УчетСерийныхНомеровПродукции.СоздатьНаборЗаписей();
		НЗ.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НЗ.Прочитать();       
		
		ТЗ = НЗ.Выгрузить();
		МожноОтменить = ТЗ.Итог("Количество");   
		Если не ЗначениеЗаполнено(МожноОтменить) Тогда 
			Прервать;
		КонецЕсли;
		
		Для Каждого СтрНЗ из НЗ Цикл  
			КоличествоОтмены = НЗ.Выгрузить().Итог("Количество");
			Если КоличествоОтмены > МожноОтменить Тогда 
				Прервать;
			КонецЕсли;   
			Если СтрНЗ.СерийныйНомер = Выборка.СерийныйНомер Тогда
				Если УдалитьСтроку Тогда 
					НЗ.Удалить(СтрНЗ); //.Очистить();
				Иначе 
					КоличествоОтмены = СтрНЗ.Количество;
					СтрНЗ.ШильдЗаказан = Ложь;
				КонецЕсли;
			Иначе 
				Продолжить;
			КонецЕсли;
		КонецЦикла;
		Попытка
			НЗ.Записать();
			МожноОтменить = МожноОтменить - КоличествоОтмены;
		Исключение
			Сообщить("Ошибка при записи регистра " + ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
				
	КонецЦикла;    
	
	Возврат Истина;
	    
КонецФункции

&НаКлиенте
Процедура НапечататьСерийныеНомера(Команда)
	
	
	ДанныеОбработки = ОпределитьДанныедляОбработки();
	МассивВыделенныхСтрок = Новый Массив;
	МассивВыделенныхСтрок = ДанныеОбработки.МассивСтрок;
	
	//МассивВыделенныхЭтапов = Новый Массив;
	//Для Каждого Стр из Объект.ТабЭтапы Цикл 
	//	Если Стр.Отметка Тогда 
	//		МассивВыделенныхЭтапов.Добавить(Стр);
	//	КонецЕсли;
	//КонецЦикла;  
	//
	//Если МассивВыделенныхЭтапов.Количество() = 0 Тогда 
	//	ДанныеОбработки = ОпределитьДанныедляОбработки();
	//	МассивВыделенныхЭтапов.Добавить(ДанныеОбработки.ДанныеТекущейСтроки);
	//КонецЕсли;        
		
	Если МассивВыделенныхСтрок.Количество() = 0 Тогда 
		//не отмечено ни одного этапа
		ОповещениепослеВопроса = Новый ОписаниеОповещения("НапечататьСерийныеНомерапослеВопроса", ЭтаФорма, Новый Структура("МассивВыделенныхСтрок", МассивВыделенныхСтрок));   //Новый Структура("КоличествоКопийЭтикеток", КоличествоКопийЭтикеток)
		ПоказатьВопрос(ОповещениепослеВопроса, "Не выбраны серийные номера для печати, распечатать все?", РежимДиалогаВопрос.ДаНет);
	Иначе               
		
		////024.06.2025               
		//ПараметрыПоиска = Новый Структура("Отметка",Истина);
		//МассивВыделенныхСтрокТабЭтапы = Объект.ТабЭтапы.НайтиСтроки(ПараметрыПоиска); 
		//Если МассивВыделенныхСтрокТабЭтапы.Количество() = 0 Тогда 
		//	МассивВыделенныхСтрокТабЭтапы.Добавить(Элементы.ТабЭтапы.ТекущиеДанные);
		//КонецЕсли;
		////-
		
		СтруктураПечати = ПолучитьСтруктуруПечати(МассивВыделенныхСтрок, КоличествоКопийЭтикеток, Ложь);
		
		МассивОбъектов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеОбработки.Номенклатура);
		ИменаМакетов = "ЭтикеткаТовары"; //ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ЭтикеткаТовары");	
			
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			"Обработка.ПечатьЭтикетокИЦенников",
			ИменаМакетов,
			МассивОбъектов,
			ЭтаФорма,
			СтруктураПечати
		);
		
	КонецЕсли;
	
КонецПроцедуры     

&НаКлиенте
Процедура НапечататьСерийныеНомерапослеВопроса(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда 
		Возврат; 
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда   
		
		////024.06.2025                
		//ПараметрыПоиска = Новый Структура();
		//МассивВыделенныхСтрокТабЭтапы = Объект.ТабЭтапы.НайтиСтроки(ПараметрыПоиска); 
		//Если МассивВыделенныхСтрокТабЭтапы.Количество() = 0 Тогда 
		//	МассивВыделенныхСтрокТабЭтапы.Добавить(Элементы.ТабЭтапы.ТекущиеДанные);
		//КонецЕсли;
		////-		
		СтруктураПечати = ПолучитьСтруктуруПечати(ДопПараметры.МассивВыделенныхСтрок, КоличествоКопийЭтикеток, Истина);
	
		МассивОбъектов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Номенклатура);
		ИменаМакетов = "ЭтикеткаТовары"; //ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ЭтикеткаТовары");	
			
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			"Обработка.ПечатьЭтикетокИЦенников",
			ИменаМакетов,
			МассивОбъектов,
			ЭтаФорма,
			СтруктураПечати
		);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
функция ПолучитьСтруктуруПечати(МассивВыделенныхСтрокТабЭтапы, КоличествоКопийЭтикеток, ВсеСтроки = Ложь)
	
	//КоличествоДляПечати = ?(КоличествоКопийЭтикеток = 0, 1,КоличествоКопийЭтикеток);	
		
	Возврат ТТМ_ДанныеВыбораСервер.СформироватьСтруктуруПечатиЭтикеток(МассивВыделенныхСтрокТабЭтапы, КоличествоКопийЭтикеток);
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если не ЗначениеЗаполнено(КоличествоКопийЭтикеток) Тогда 
		КоличествоКопийЭтикеток = 1;      
	КонецЕсли;
	ЭтапыЗагружены = ОбновитьТаблицуЭтапов();
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ИзменитьСерийныйНомер(Команда)
	
	Если Объект.ТабЭтапы.Количество() = 0 Тогда 
		Сообщить("Не выбран Этап!");
		Возврат;
	КонецЕсли;                      
	
	Если Элементы.ТабЭтапы.ТекущиеДанные = Неопределено Тогда 
		Элементы.ТабЭтапы.ТекущаяСтрока = 0;
	КонецЕсли;
		
	//ДанныеТекСтроки = Новый Структура("Номенклатура, ЭтапПроизводства, Серийныйномер, СтарыйСерийныйНомер");
	//МассивЭтапов = Новый Массив;
	//Для Каждого СтрЭтапы из Объект.ТабЭтапы Цикл     
	//	Если Стрэтапы.Отметка Тогда 
	//		МассивЭтапов.Добавить(СтрЭтапы.ЭтапПроизводства);
	//	КонецЕсли;
	//КонецЦикла;    
	//Если МассивЭтапов.Количество() = 0 Тогда 
	//	//СтруктураСтроки = Новый Структура("Номенклатура, ЭтапПроизводства, Запланировано, СтарыйСерийныйномер");
	//	//ЗаполнитьЗначенияСвойств(СтруктураСтроки, Элементы.ТабЭтапы.ТекущиеДанные);
	//	МассивЭтапов.Добавить(Элементы.ТабЭтапы.ТекущиеДанные.ЭтапПроизводства);
	//КонецЕсли;    
	//ЗаполнитьЗначенияСвойств(ДанныеТекСтроки,Элементы.ТабЭтапы.ТекущиеДанные);
	
	ДанныеОбработки = ОпределитьДанныедляОбработки();
	ДопПараметры = Новый Структура("ДанныеТекущейСтроки, МассивЭтапов"); //, ДанныеОбработки.ДанныеТекущейСтроки, ДанныеОбработки.МассивЭтапов); 
	ЗаполнитьЗначенияСвойств(ДопПараметры,ДанныеОбработки);
	Если ДопПараметры.ДанныеТекущейСтроки.ШильдЗаказан Тогда 
		ОповещениеШильдЗаказан = Новый ОписаниеОповещения("ОповещениеШильдЗаказан",ЭтаФорма,ДопПараметры);
		ПоказатьВопрос(ОповещениеШильдЗаказан,"Для данного экземпляра продукции уже заказан шильд, продолжить изменение?",РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ОповещениеПослеВводаСтроки =Новый ОписаниеОповещения("ПослеВводаСтроки", ЭтаФорма, ДопПараметры); 
	
	МассивЧастейСН = СтрРазделить(ДанныеОбработки.ДанныеТекущейСтроки.СерийныйНомер,"-");  
	Если МассивЧастейСН.Количество() = 3 Тогда 
		ТекНомер = МассивЧастейСН[2];
	Иначе 
		ТекНомер = "";
	КонецЕсли;
	
	НомерНовый = ТекНомер;
	ПоказатьВводСтроки(ОповещениеПослеВводаСтроки,НомерНовый,,4,Ложь);
	
КонецПроцедуры    

&НаКлиенте
Процедура ОповещениеШильдЗаказан(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда 
		Возврат;
	КонецЕсли;
	
	ОповещениеПослеВводаСтроки =Новый ОписаниеОповещения("ПослеВводаСтроки", ЭтаФорма, ДопПараметры); 
	
	МассивЧастейСН = СтрРазделить(ДопПараметры.ДанныеТекущейСтроки.СерийныйНомер,"-");  
	Если МассивЧастейСН.Количество() = 3 Тогда 
		ТекНомер = МассивЧастейСН[2];
	Иначе 
		ТекНомер = "";
	КонецЕсли;
	
	НомерНовый = ТекНомер;
	ПоказатьВводСтроки(ОповещениеПослеВводаСтроки,НомерНовый,,4,Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСтроки(Строка, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Строка) Тогда //НЕ Строка = Неопределено Тогда  
		НовыйНомерЗаписан = ПроверитьЗаписатьНовыйномер(Строка, ДопПараметры);
	КонецЕсли;                
	
	Если НовыйНомерЗаписан = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если НовыйНомерЗаписан Тогда 
		
		ЭтапыЗагружены = ОбновитьТаблицуЭтапов();      
		
		ПараметрыОтбора = Новый Структура("Номенклатура, ЭтапПроизводства", ДопПараметры.ДанныеТекущейСтроки.Номенклатура, ДопПараметры.МассивЭтапов[0]); 
		Если Объект.ТабЭтапы.НайтиСтроки(ПараметрыОтбора).Количество() > 0 Тогда 
			ТекСтрока = Объект.ТабЭтапы.НайтиСтроки(ПараметрыОтбора)[0]; 
			Элементы.ТабЭтапы.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры   

//&НаСервере
//Функция ПолучитьКорректныйНовыйНомер(СтрНовыйНомер, ДанныеТекСтроки)
//	
//	Возврат ТТМ_СерийныйУчет.ПроверитьКорректностьСерийногоНомера(СтрНовыйНомер, ДанныеТекСтроки);
//	
//КонецФункции   

//&НаСервере
//Функция ЗаписатьНовыйНомер(СтрНовыйНомер, ДанныеТекСтроки, МассивЭтапов)
//	
//	Возврат ТТМ_СерийныйУчет.ЗаписатьНовыйСерийныйНомер(СтрНовыйНомер, ДанныеТекСтроки, МассивЭтапов);
//	
//КонецФункции   

&НаСервере
Функция ПроверитьЗаписатьНовыйномер(Строка, ДопПараметры)
	
	НовыйНомер = Строка;
	Если СтрДлина(НовыйНомер) < 4 Тогда 
		Пока не СтрДлина(НовыйНомер) = 4 Цикл                                                               
			НовыйНомер = "0" + НовыйНомер;
		КонецЦикла;  
	КонецЕсли;
    //НовыйСерийныйНомер = ПолучитьКорректныйНовыйНомер(НовыйНомер, Параметры.ДанныеТекСтроки);
	НовыйСерийныйНомер = ТТМ_СерийныйУчет.ПроверитьКорректностьСерийногоНомера(НовыйНомер, ДопПараметры.ДанныеТекущейСтроки);
	Если НовыйСерийныйНомер <> Неопределено Тогда 
		НомерУспешноЗаписан = ТТМ_СерийныйУчет.ЗаписатьНовыйСерийныйНомер(НовыйСерийныйНомер, ДопПараметры.ДанныеТекущейСтроки, ДопПараметры.МассивЭтапов);
		Если не НомерУспешноЗаписан Тогда 
			Сообщить("Не удалось записать новый серийный номер " + Строка + " для номенклатуры " + ДопПараметры.ДанныеТекущейСтроки.Номенклатура);
			Возврат Ложь;
		Иначе 
			Возврат Истина
		КонецЕсли;
	Иначе 
		Сообщить("Введенный номер """ + Строка + """ не прошел проверку корректности!");
		Возврат Ложь;
	КонецЕсли;    
	
КонецФункции

&НаКлиенте
Процедура НачатьУчетСерийныхНомеровПродукции(Команда)
	
	Если не ЗначениеЗаполнено(НачальныйНомер) Тогда 
		Сообщить("Для начала учета серийных номеров укажите начальный серийный номер!");
		Возврат;
	КонецЕсли;
	
	ДанныеТекСтроки = Элементы.ТабЭтапы.ТекущиеДанные;
	Если не ЗначениеЗаполнено(Объект.Номенклатура) Тогда                                                   
		
		ДопПараметры = Новый Структура("Номенклатура", ДанныеТекСтроки.Номенклатура);
		ОповещениеПослеВопроса = Новый ОписаниеОповещения("ПослеВопросаНачатьУчетСерийныхномеров", ЭтаФорма, ДопПараметры);
		ПоказатьВопрос(ОповещениеПослеВопроса,"Начать учет по серийным номерам для продукции " +  ДанныеТекСтроки.Номенклатура + "?",РежимДиалогаВопрос.ДаНет);
		
	Иначе 
		
		//ДанныеТекСтроки = Новый Структура("Номенклатура, ЭтапПроизводства, Серийныйномер, СтарыйСерийныйНомер");
		МассивЭтапов = Новый Массив;
		Для Каждого СтрЭтапы из Объект.ТабЭтапы Цикл     
			Если Стрэтапы.Отметка Тогда 
				МассивЭтапов.Добавить(СтрЭтапы.ЭтапПроизводства);
			КонецЕсли;
		КонецЦикла;    
		Если МассивЭтапов.Количество() = 0 Тогда 
			МассивЭтапов.Добавить(Элементы.ТабЭтапы.ТекущиеДанные.ЭтапПроизводства);
		КонецЕсли;
		
		Успешно = НачатьУчетСерийныхномровНаСервере(Объект.Номенклатура, НачальныйНомер, МассивЭтапов);
		Если Успешно Тогда 
			НачальныйНомер = 0;
		КонецЕсли;
		
		ЭтапыЗагружены = ОбновитьТаблицуЭтапов();
		
		ПараметрыОтбора = Новый Структура("Номенклатура, ЭтапПроизводства", ДанныеТекСтроки.Номенклатура,МассивЭтапов[0]); 
		Если Объект.ТабЭтапы.НайтиСтроки(ПараметрыОтбора).Количество() > 0 Тогда 
			ТекСтрока = Объект.ТабЭтапы.НайтиСтроки(ПараметрыОтбора)[0]; 
			Элементы.ТабЭтапы.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
		КонецЕсли;
	
	КонецЕсли;  
		
КонецПроцедуры  

&НаКлиенте
Процедура ПослеВопросаНачатьУчетСерийныхномеров(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда 
		Возврат;
	КонецЕсли;
	
	МассивЭтапов = Новый Массив;
	Для Каждого СтрЭтапы из Объект.ТабЭтапы Цикл     
		Если Стрэтапы.Отметка Тогда 
			МассивЭтапов.Добавить(СтрЭтапы.ЭтапПроизводства);
		КонецЕсли;
	КонецЦикла;    
	Если МассивЭтапов.Количество() = 0 Тогда 
		МассивЭтапов.Добавить(Элементы.ТабЭтапы.ТекущиеДанные.ЭтапПроизводства); 
	КонецЕсли; 
	
	Успешно = НачатьУчетСерийныхномровНаСервере(ДопПараметры.Номенклатура, НачальныйНомер, МассивЭтапов);
	Если Успешно Тогда 
		НачальныйНомер = 0;
	КонецЕсли;
	
	ЭтапыЗагружены = ОбновитьТаблицуЭтапов();  
	
	ПараметрыОтбора = Новый Структура("Номенклатура, ЭтапПроизводства", ДопПараметры.Номенклатура,МассивЭтапов[0]); 
	Если Объект.ТабЭтапы.НайтиСтроки(ПараметрыОтбора).Количество() > 0 Тогда 
		ТекСтрока = Объект.ТабЭтапы.НайтиСтроки(ПараметрыОтбора)[0]; 
		Элементы.ТабЭтапы.ТекущаяСтрока = ТекСтрока.ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НачатьУчетСерийныхномровНаСервере(Номенклатура, НачальныйНомер, МассивЭтапов)
	
	//1. Проверим/установим признак учета серийных номеров для продукции   
	
	ВключенУчетСерийныхНомеров = ТТМ_СерийныйУчет.ПроверитьУстановитьУчетСерийныхНомеров(Номенклатура, Истина);	
		
	//2.    
	
	Если ВключенУчетСерийныхНомеров Тогда    
		//ДанныеЭтапа = ТТМ_СерийныйУчет.ПолучитьДанныеЭтапа(МассивЭтапов[0].ЭтапПроизводства);
		НомерЭтапа = 0;
		Для Каждого ЭтапПроизводства Из МассивЭтапов Цикл  
			СерийныйНомерУстановлен = ТТМ_СерийныйУчет.ЗаписатьСерийныйНомерПродукцииПослеПроверки(ЭтапПроизводства, НачальныйНомер + НомерЭтапа);
			//ТТМ_СерийныйУчет.СгененироватьСерийныйНомер(Стр.Номенклатура, Стр.ДатаЗапуска, НачальныйНомер, 
			Если не СерийныйНомерУстановлен Тогда 
				Возврат Ложь;
				Сообщить("Не удалось установить серийные номера для продукции " + Номенклатура + " по этапу " + ЭтапПроизводства, СтатусСообщения.Важное);
			Иначе 
				НомерЭтапа = НомерЭтапа + 1;
			КонецЕсли;       		
		КонецЦикла; 
		
		Возврат Истина;
		
	Иначе   
		Возврат Ложь;
		Сообщить("Серийный номер не установлен!");
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ТабЭтапыОтметкаПриИзменении(Элемент)
	
	ТекСтрока = Элемент.Родитель.ТекущиеДанные;   // Элементы[Элемент.Родитель.Имя].ТекущиеДанные
	ПараметрыПоиска = Новый Структура("ЭтапПРоизводства",ТекСтрока.ЭтапПроизводства);
	МассивСтрокПоЭтапу = Объект.ТабЭтапы.НайтиСтроки(ПараметрыПоиска);
	Если МассивСтрокПоЭтапу.Количество() > 1 Тогда
		Для Каждого Стр из МассивСтрокПоЭтапу Цикл 
			Стр.Отметка = Истина;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#Область СтраницаАмина

	&НаСервереБезКонтекста
Процедура ЗаполнитьРеализациюВСтрокеВыпускаНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер КАК СерийныйНомер,
			|	ТТМ_УчетСерийныхНомеровПродукции.Регистратор КАК Регистратор,
			|	ТТМ_УчетСерийныхНомеровПродукции.Номенклатура КАК Номенклатура
			|ПОМЕСТИТЬ ОтгруженныеСерийныеНомера
			|ИЗ
			|	РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции КАК ТТМ_УчетСерийныхНомеровПродукции
			|ГДЕ
			|	ТТМ_УчетСерийныхНомеровПродукции.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
			|
			|СГРУППИРОВАТЬ ПО
			|	ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер,
			|	ТТМ_УчетСерийныхНомеровПродукции.Регистратор,
			|	ТТМ_УчетСерийныхНомеровПродукции.Номенклатура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ОтгруженныеСерийныеНомера.СерийныйНомер КАК СерийныйНомер,
			|	ОтгруженныеСерийныеНомера.Номенклатура КАК Номенклатура,
			|	ЕСТЬNULL(ТТМ_УчетСерийныхНомеровПродукции.Регистратор, ЗНАЧЕНИЕ(Документ.ЭтапПроизводства2_2.ПустаяСсылка)) КАК ЭтапПроизводства,
			|	ОтгруженныеСерийныеНомера.Регистратор КАК Реализация
			|ИЗ
			|	ОтгруженныеСерийныеНомера КАК ОтгруженныеСерийныеНомера
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции КАК ТТМ_УчетСерийныхНомеровПродукции
			|		ПО (ОтгруженныеСерийныеНомера.СерийныйНомер = ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер)
			|			И (ОтгруженныеСерийныеНомера.Номенклатура = ТТМ_УчетСерийныхНомеровПродукции.Номенклатура)
			|ГДЕ
			|	ТТМ_УчетСерийныхНомеровПродукции.Регистратор ССЫЛКА Документ.ЭтапПроизводства2_2
			|
			|УПОРЯДОЧИТЬ ПО
			|	СерийныйНомер";   
                                  
	//СвойствоКддТМ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","КодТМ_ТТМ");
	//УчетСерийныхНомеров = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","УчитываатьСерийныеНомераНоменклатуры_ТТМ");
	//Запрос.УстановитьПараметр("СвойствоКодТМ",СвойствоКддТМ);
	//Запрос.УстановитьПараметр("УчетСерийныхНомеров",УчетСерийныхНомеров);
	ТабДанныеПоОтгруженнымСН = Запрос.Выполнить().Выгрузить(); 
	
	Для Каждого Стр из ТабДанныеПоОтгруженнымСН Цикл 
		НЗ = РегистрыНакопления.ТТМ_УчетСерийныхНомеровПродукции.СоздатьНаборЗаписей();
		НЗ.Отбор.Регистратор.Установить(Стр.ЭтапПроизводства);
		НЗ.Прочитать();
		Если НЗ.Количество() > 1 Тогда 
			НЗ.Отбор.Серийныйномер.Установить(Стр.СерийныйНомер);
			НЗ.Прочитать();
			Если НЗ.Количество() = 1 Тогда 
				СтрокаРегистра = НЗ[0];
				СтрокаРегистра.Реализация = Стр.Реализация;
				НЗ.Записать();
			Иначе 
				Сообщить("Для Этапа " + Стр.ЭтапПроизводства + "найдено более 1 строки регистра - операция не выполнена!");
				Продолжить;
			КонецЕсли;
		ИначеЕсли НЗ.Количество() = 1 Тогда 
			СтрокаРегистра = НЗ[0];
			СтрокаРегистра.ДокументРеализации = Стр.Реализация;
			НЗ.Записать();
		Иначе
			Сообщить("Отсутствуют отгруженные серийные номера для этапа " + Стр.ЭтапПроизводства + " - операция не выполнена!");
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеализациюВСтрокеВыпуска(Команда)
	ЗаполнитьРеализациюВСтрокеВыпускаНаСервере();
КонецПроцедуры

&НаСервере
Процедура Группа6ПриСменеСтраницыНаСервере()
	
	//Таб = РеквизитФормыВЗначение("ДанныеОтгруженныхСерийныхНомеров",Тип("ТаблицаЗначений"));
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер КАК СерийныйНомер,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор КАК Регистратор,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ОтгруженныеСерийныеНомера
	               |ИЗ
	               |	РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции КАК ТТМ_УчетСерийныхНомеровПродукции
	               |ГДЕ
	               |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор,
	               |	ТТМ_УчетСерийныхНомеровПродукции.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ОтгруженныеСерийныеНомера.СерийныйНомер КАК СерийныйНомер,
	               |	ОтгруженныеСерийныеНомера.Номенклатура КАК Номенклатура,
	               |	ВЫРАЗИТЬ(ЕСТЬNULL(ТТМ_УчетСерийныхНомеровПродукции.Регистратор, ЗНАЧЕНИЕ(Документ.ЭтапПроизводства2_2.ПустаяСсылка)) КАК Документ.ЭтапПроизводства2_2) КАК ЭтапПроизводства,
	               |	ВЫРАЗИТЬ(ОтгруженныеСерийныеНомера.Регистратор КАК Документ.РеализацияТоваровУслуг) КАК Реализация
	               |ИЗ
	               |	ОтгруженныеСерийныеНомера КАК ОтгруженныеСерийныеНомера
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции КАК ТТМ_УчетСерийныхНомеровПродукции
	               |		ПО ОтгруженныеСерийныеНомера.СерийныйНомер = ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер
	               |			И ОтгруженныеСерийныеНомера.Номенклатура = ТТМ_УчетСерийныхНомеровПродукции.Номенклатура
	               |ГДЕ
	               |	ТТМ_УчетСерийныхНомеровПродукции.Регистратор ССЫЛКА Документ.ЭтапПроизводства2_2
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СерийныйНомер";
	
	ТабОтгруженныеСерийныеНомера = Запрос.Выполнить().Выгрузить(); 
	ДанныеОтгруженныхСерийныхНомеров.Загрузить(ТабОтгруженныеСерийныеНомера);
	
	//АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ТабОтгруженныеСерийныеНомера, УникальныйИдентификатор);
	//Результат = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	//Если не Результат = Неопределено Тогда 
	//	ДанныеОтгруженныхСерийныхНомеров.Загрузить(Результат);
	//КонецЕсли;
	
	//ЗначениеВРеквизитФормы(Таб,"ДанныеОтгруженныхСерийныхНомеров");
	
КонецПроцедуры

&НаКлиенте
Процедура Группа6ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "СтраницаАдминистрированиеСН" Тогда 
		Группа6ПриСменеСтраницыНаСервере();
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

//&НаКлиенте
//Процедура ПолучитьШильды(Команда)
//	
//	//ШильдПолучен = ОтразитьОперациюСШильдами("ШильдВНаличии", Истина);
//	//Если ШильдПолучен Тогда 
//	//	Сообщить("Получение шильдов отражено");
//	//Иначе 
//	//	Сообщить("Не удалось отразить получение шильдов!");
//	//КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОтменитьПолучение(Команда)
//	
//	ПолучениеШильдовОтменено = ОтразитьОперациюСШильдами("ШильдВНаличии", Ложь);
//	Если ПолучениеШильдовОтменено Тогда 
//		Сообщить("Получение шильдов отменено");
//	Иначе 
//		Сообщить("Не удалось отменить получение шильдов!");
//	КонецЕсли; 
//	
//КонецПроцедуры
 
//&НаКлиенте
//Функция ОтразитьОперациюСШильдами(ИмяПоля,ЗаказатьПолучитьШильды)
//	
//	ПараметрыОтбора = Новый Структура("отметка", Истина);
//	МассивСтрок = Объект.ТабЭтапы.НайтиСтроки(ПараметрыОтбора);
//	МассивЭтапов = Новый Массив;   
//	МассивСН = Новый Массив;
//	Для Каждого Стр из МассивСтрок Цикл              
//		Если Стр[ИмяПоля] = ЗаказатьПолучитьШильды Тогда  
//			Продолжить;
//		Иначе 
//			МассивЭтапов.Добавить(Стр.ЭтапПроизводства);
//			МассивСН.Добавить(Стр.СерийныйНомер);
//		КонецЕсли;
//	КонецЦикла;  
//	
//	Если МассивЭтапов.Количество() > 0 Тогда                
//		ЗаписьВРегистр = ЗаказатьПолучитьШильдыНаСервере(МассивЭтапов, ИмяПоля, ЗаказатьПолучитьШильды, МассивСН);
//	Иначе 
//		Сообщить("Не выбраны этапы для обработки!");
//	КонецЕсли;
//	
//	ЭтапыОбновлены = ОбновитьТаблицуЭтапов();
//	
//	Для Каждого Стр1 из МассивСтрок Цикл 
//		Стр1.Отметка = ЗаказатьПолучитьШильды;
//	КонецЦикла; 
//	
//	Если ЭтапыОбновлены Тогда 
//		ЭтаФорма.ОбновитьОтображениеДанных(Элементы.ТабЭтапы);
//	КонецЕсли; 
//	Возврат ЗаписьВРегистр;
//	
//КонецФункции

//&НаСервереБезКонтекста
//Функция ПроверитьУстановитьУчетСерийныхНомеров(Номенклатура, ВключитьУчетСерийныхНомеров = Ложь)
//	
//	ДополнительныйРеквизит = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","УчитываатьСерийныеНомераНоменклатуры_ТТМ");
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	НоменклатураДополнительныеРеквизиты.Ссылка КАК Ссылка,
//	               |	НоменклатураДополнительныеРеквизиты.Свойство КАК Свойство,
//	               |	НоменклатураДополнительныеРеквизиты.Значение КАК Значение
//	               |ИЗ
//	               |	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
//	               |ГДЕ
//	               |	НоменклатураДополнительныеРеквизиты.Ссылка = &Номенклатура
//	               |	И НоменклатураДополнительныеРеквизиты.Свойство = &ДопРеквизитУчетСерий";
//	
//	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
//	Запрос.УстановитьПараметр("ДопРеквизитУчетСерий",ДополнительныйРеквизит);
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	Если Выборка.Следующий() и Выборка.Значение Тогда
//		Сообщить("Учет серий уже включен для данной номенклатуры");
//		Возврат Истина;
//	Иначе  
//		Если ВключитьУчетСерийныхНомеров Тогда 
//			//Номенклатура = Справочники.Номенклатура.СоздатьЭлемент();
//			НоменклатураОбъект = Номенклатура.ПолучитьОбъект();
//			НоваяСтрока = НоменклатураОбъект.ДополнительныеРеквизиты.Добавить();
//			НоваяСтрока.Свойство = ДополнительныйРеквизит;
//			НоваяСтрока.Значение = Истина;
//			Попытка
//				НоменклатураОбъект.Записать();
//				Возврат Истина;
//			Исключение
//				Сообщить("Ошибка при записи номенклатуры" + ОписаниеОшибки());
//				Возврат Ложь;
//			КонецПопытки;
//		Иначе 
//			Возврат Ложь;
//		КонецЕсли;
//	КонецЕсли;
//	
//КонецФункции

//////////////////////////////////////////////////////////////////////////////////


//&НаКлиенте
//Процедура ПерейтиКИзменениюСерийногоНомера(Команда)
//	
//	ПараметрыПоиска = Новый Структура("Отметка", Истина);
//	МассивВыбранныхСтрок = Объект.ТабЭтапы.НайтиСтроки(ПараметрыПоиска);
//	Если МассивВыбранныхСтрок.Количество() < 1 Тогда 
//		ДанныеСтроки = Новый Структура("Номенклатура, ЭтапПроизводства, СерийныйНомер");
//		ЗаполнитьЗначенияСвойств(ДанныеСтроки,Элементы.ТабЭтапы.ТекущиеДанные);
//		МассивВыбранныхСтрок.Добавить(ДанныеСтроки);
//	КонецЕсли;
//	
//	ПараметрыОткрытия = Новый Структура("МассивСтрок",МассивВыбранныхСтрок);
//	ОткрытьФорму("Обработка.РаботаССерийнымиНомерами.Форма.ФормаРедактированияСерийныхНомеров",ПараметрыОткрытия);	
//	
//КонецПроцедуры


// &НаСервереБезКонтекста
//Функция ЗаказатьПолучитьШильдыНаСервере(МассивЭтапов,ИмяПоля,ЗаказатьПолучитьШильды, МассивСН)
//	
//	
//	
//	НЗ = РегистрыНакопления.ТТМ_УчетСерийныхНомеровПродукции.СоздатьНаборЗаписей();
//	Для Каждого ЭтапПроизводства Из МассивЭтапов Цикл          
//		
//		РезультатПроверки = ТТМ_СерийныйУчет.ПроверитьЗаписатьСерийныйНомерПродукцииПриВыпуске(ЭтапПРоизводства);
//		
//		
//		НЗ.Отбор.Регистратор.Установить(ЭтапПроизводства);
//		НЗ.Прочитать();
//		Для Каждого СтрНЗ из НЗ Цикл 
//			//МассивСН = Новый Массив;
//			Если МассивСН.Найти(СтрНЗ.СерийныйНомер) <> Неопределено Тогда 
//				СтрНЗ[ИмяПоля] = ЗаказатьПолучитьШильды;
//			Иначе 
//				Продолжить;
//			КонецЕсли;
//		КонецЦикла; 
//		Попытка
//			НЗ.Записать();
//		Исключение      
//			Сообщить("Ошибка при записи данных регистра учета Серийных номеров" + ОписаниеОшибки());
//			Возврат Ложь;
//		КонецПопытки;
//	КонецЦикла;
//	
//	Возврат Истина;
//	
//КонецФункции
